BPEL/BPELComposite/test/AddHotel/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:customerData">
  <soapenv:Body>
    <urn:customerId>
      <urn:id>33</urn:id>
    </urn:customerId>
    <urn:hotel>
      <name>Hotel D'Angleterre</name>
        <address>34, Kongens Nytorv, 1050 København K</address>
        <bookingNumber>1</bookingNumber>
        <price>500</price>
        <creditCardGuaranteeRequired>true</creditCardGuaranteeRequired>
        <hotelReservationService>NiceView</hotelReservationService>
    </urn:hotel>
  </soapenv:Body>
</soapenv:Envelope>